---
kind: method
id: M:Autodesk.Revit.UI.Events.ExecutedEventArgs.GetJournalData
source: html/41841f02-a3b4-0b1f-50fb-88f368e9fed5.htm
---
# Autodesk.Revit.UI.Events.ExecutedEventArgs.GetJournalData Method

Gets the journal data associated to this command (on journal playback).

## Syntax (C#)
```csharp
public IDictionary<string, string> GetJournalData()
```

## Remarks
For details about the use of journal data associated to a command, see ExternalCommandData.JournalData.